app/views/checkouts/edit.html.erb

    	<% if @checkout.completed_with? %>
    		<% for wwt in WorkedWithType.all %>
---
SELECT `worked_with_types`.* FROM `worked_with_types`