app/views/checkouts/index.html.erb

SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) LIMIT 1
SELECT `publishers`.* FROM `publishers` WHERE (`publishers`.`id` = 1) LIMIT 1
---
  <tr>
    <td><%= checkout.user.first_name %> <%=h checkout.user.last_name %></td>
    <td><%= checkout.territory.name %></td>
    <td><%= User.find(checkout.publisher_id).last_name %>, <%= User.find(checkout.publisher_id).first_name %></td>