app/views/checkouts/show.html.erb

  <b>User:</b>
  <%=h @checkout.user.first_name %> <%=h @checkout.user.last_name %>
---
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) LIMIT 1