app/views/territories/index.html.erb

<% @territories.each do |territory| %>
<% tt = @territory_types.select { |tt| tt.id == territory.territory_type_id.to_i } %>
---
SELECT `territories`.* FROM `territories` ORDER BY name asc
SELECT `territory_types`.* FROM `territory_types`