app/controllers/checkouts_controller.rb

  def index

    # New Check Out
    @checkout = Checkout.new
    @worked_with_types = WorkedWithType.all(:conditions => { "active" => "Y"}) # All active worked with types
    @territories = territories # Method for listing territories oldest first
    @publishers = publishers # Method for listing publishers in alphabetical order


    # Check Outs List
    @checkouts = Checkout.all
    @publisers = Publisher.all
---
SELECT `worked_with_types`.* FROM `worked_with_types` WHERE (`worked_with_types`.`active` = 'Y')
SELECT `checkouts`.* FROM `checkouts` WHERE (checked_in IS NOT NULL AND territory_type_id = 1) ORDER BY checked_in ASC LIMIT 1
SELECT `publishers`.* FROM `publishers`

  def show
    @checkout = Checkout.find(params[:id])
---
SELECT `checkouts`.* FROM `checkouts` WHERE (`checkouts`.`id` = 6) LIMIT 1

  def new
    @checkout = Checkout.new
    @worked_with_types = WorkedWithType.all(:conditions => { "active" => "Y"})
---
SELECT `worked_with_types`.* FROM `worked_with_types` WHERE (`worked_with_types`.`active` = 'Y')

  def edit
    @checkout = Checkout.find(params[:id])
---
SELECT `checkouts`.* FROM `checkouts` WHERE (`checkouts`.`id` = 23) LIMIT 1

  def create
    puts "+++++++++++++++++++"
    puts params[:checkout].inspect
    puts "+++++++++++++++++++"
    params[:checkout][:territory_type_id] = Territory.find(params[:checkout][:territory_id]).territory_type_id
    @checkout = Checkout.new(params[:checkout])

    respond_to do |format|
      if @checkout.save
---
SELECT `territories`.* FROM `territories` WHERE (`territories`.`id` = 13) LIMIT 1
INSERT INTO `checkouts` (`checked_in`, `checkin_user_id`, `updated_at`, `publisher_id`, `worked_with_type_id`, `completed_with`, `territory_type_id`, `created_at`, `territory_id`, `notes`, `user_id`, `checked_out`) VALUES(NULL, NULL, '2015-11-04 00:26:17', 6, NULL, '', 1, '2015-11-04 00:26:17', 1, 'hi', 1, '2015-11-04 00:00:00')

  def update
    @checkout = Checkout.find(params[:id])

    respond_to do |format|
      if @checkout.update_attributes(params[:checkout])
---
SELECT `checkouts`.* FROM `checkouts` WHERE (`checkouts`.`id` = 1) LIMIT 1
UPDATE `checkouts` SET `checked_in` = '2016-11-06 05:00:00', `completed_with` = '3', `notes` = 'this was work', `updated_at` = '2016-11-06 21:03:49' WHERE (`checkouts`.`id` = 1)

  def destroy
    @checkout = Checkout.find(params[:id])
    @checkout.destroy
---
SELECT * FROM `checkouts` WHERE (`checkouts`.`id` = 4)
DELETE FROM `checkouts` WHERE `id` = 4