app/controllers/checkouts_controller.rb

  def show
    @checkout = Checkout.find(params[:id])
    @publisher = User.find(@checkout.publisher_id)
---
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) LIMIT 1

  def update
    if Checkout.find(params[:id]).checked_in.nil?
      @checkout = Checkout.find(params[:id])
      @checkout.checkin_user_id = current_user.id
    else
      @checkout = Checkout.find(params[:id])
---
SELECT `users`.* FROM `users` WHERE (`users`.`id` = 1) LIMIT 1