app/controllers/congregations_controller.rb

SELECT `congregations`.* FROM `congregations`
---
  def index
    @congregations = Congregation.all