app/controllers/password_resets_controller.rb

  def create
  user = User.find_by_email(params[:email])
---
SELECT `users`.* FROM `users` WHERE `users`.`email` = 'example@example.com' LIMIT 1