app/controllers/publishers_controller.rb

  def index
    @publishers = Publisher.all
---
SELECT `publishers`.* FROM `publishers`

  def show
    @publisher = Publisher.find(params[:id])

    @publisher_history = {}
    @publisher.checkouts.each do |hist|
---
SELECT `publishers`.* FROM `publishers` WHERE (`publishers`.`id` = 9) LIMIT 1
SELECT `checkouts`.* FROM `checkouts` WHERE (`checkouts`.publisher_id = 9)

  def edit
    @publisher = Publisher.find(params[:id])
---
SELECT * FROM `publishers` WHERE (`publishers`.`id` = 1)

  def create
    @publisher = Publisher.new(params[:publisher])

    respond_to do |format|
      if @publisher.save
---
INSERT INTO `publishers` (`first_name`, `textmessage`, `last_name`, `updated_at`, `active`, `email`, `notes`, `phone_number`, `created_at`) VALUES('john', NULL, 'george', '2015-11-08 04:55:55', 'Y', 'serverjohn@yahoo.com', '', '3202231801', '2015-11-08 04:55:55')

  def update
    @publisher = Publisher.find(params[:id])

    respond_to do |format|
      if @publisher.update_attributes(params[:publisher])
---
SELECT * FROM `publishers` WHERE (`publishers`.`id` = 9)
UPDATE `publishers` SET `updated_at` = '2015-11-08 05:23:12', `phone_number` = 3202231801 WHERE `id` = 9

  def destroy
    @publisher = Publisher.find(params[:id])
    @publisher.destroy
---
SELECT * FROM `publishers` WHERE (`publishers`.`id` = 2)
DELETE FROM `publishers` WHERE `id` = 2