app/controllers/territory_types_controller.rb

SELECT `territory_types`.* FROM `territory_types`
---
  def index
    @territory_type = TerritoryType.all

SELECT `territory_types`.* FROM `territory_types` WHERE (`territory_types`.`id` = 1) LIMIT 1
---
  def show
    @territory_type = Territory_type.find(params[:id])

SELECT `territory_types`.* FROM `territory_types` WHERE `territory_types`.`id` = 1 LIMIT 1
---
  def edit
    @territory_type = TerritoryType.find(params[:id])

INSERT INTO `territory_types` (`active`, `checkout_id`, `name`) VALUES ('Y', NULL, 'Rural')
---
  def create
    @publisher = TerritoryType.new(params[:territory_type])

    respond_to do |format|
      if @publisher.save