app/controllers/territories_controller.rb

SELECT * FROM `territories` WHERE (name LIKE '%a')
SELECT `territories`.* FROM `territories` ORDER BY name asc
SELECT `territory_types`.* FROM `territory_types`
---
  def index
    if params[:search]
      @territories = Territory.find(:all, :conditions => ['name LIKE ?', "%#{params[:search]}"]).paginate(:per_page => 10, :page => params[:page])
    else
      @territories = Territory.all(:order => sort_column + " " + sort_direction).paginate(:per_page => 10, :page => params[:page])
    end

    @territory_types = TerritoryType.all

SELECT * FROM `territories` WHERE (`territories`.`id` = 1)
---
  def show
    @territory = Territory.find(params[:id])

SELECT `territory_types`.* FROM `territory_types` WHERE (`territory_types`.`active` = 'Y')
---
  def new
    @territory = Territory.new

    @territory_types = []
    territory_types = TerritoryType.all(:conditions => { "active" => "Y"})

SELECT `territories`.* FROM `territories` WHERE (`territories`.`id` = 5) LIMIT 1
---
  def edit
    @territory = Territory.find(params[:id])

SELECT `territories`.`id` FROM `territories` WHERE (`territories`.`map` = BINARY 'monkey_business_cards_Logo.png') LIMIT 1
INSERT INTO `territories` (`updated_at`, `notes`, `type`, `map`, `name`, `created_at`, `description`) VALUES('2013-10-29 20:29:46', 'I think this territory is lost.', NULL, 'Replace with image?', 'R1', '2013-10-29 20:29:46', 'Rural territory number 1')
---
  def create
    puts "+++++++++++++++++++"
    puts params[:territory].inspect
    puts "+++++++++++++++++++"

    uploaded_io = params[:territory][:map]
    File.open(Rails.root.join('public', 'uploads', uploaded_io.original_filename), 'wb') do |file|
      file.write(uploaded_io.read)
    end
    params[:territory][:map] = params[:territory][:map].original_filename

    @territory = Territory.new(params[:territory])

    respond_to do |format|
      if @territory.save

SELECT * FROM `territories` WHERE (`territories`.`id` = 14)
---
  def update
    @territory = Territory.find(params[:id])

SELECT * FROM `territories` WHERE (`territories`.`id` = 8)
DELETE FROM `territories` WHERE `id` = 8
---
  def destroy
    @territory = Territory.find(params[:id])
    @territory.destroy