app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO `users` (`email`, `username`, `password_salt`, `password_hash`, `created_at`, `updated_at`, `role`) VALUES('serverjohn@yahoo.com', 'serverjohn', '6efa9c77e048397454df72e63d212fbfb165c44d', '4ac3dedac0fd323cb999cb500e0c6930cb226f54', '2016-03-19 22:14:43', '2016-03-19 22:14:43', NULL)

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)
UPDATE `users` SET `updated_at` = '2016-03-20 04:58:12', `first_name` = '', `last_name` = '', `user_role` = 'admin' WHERE `id` = 1